CSI API ETABS v1
cDetailing.GetDetailed_OneWallStack Method
 Detailed output for Wall
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailed_OneWallStack(
	int WallStackIndex,
	ref string GUID,
	ref int TowerID,
	ref int NumberPiers,
	ref int NUmberSpandrels
)
Function GetDetailed_OneWallStack (
	WallStackIndex As Integer,
	ByRef GUID As String,
	ByRef TowerID As Integer,
	ByRef NumberPiers As Integer,
	ByRef NUmberSpandrels As Integer
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim GUID As String
Dim TowerID As Integer
Dim NumberPiers As Integer
Dim NUmberSpandrels As Integer
Dim returnValue As Integer
returnValue = instance.GetDetailed_OneWallStack(WallStackIndex,
	GUID, TowerID, NumberPiers, NUmberSpandrels)
int GetDetailed_OneWallStack(
	int WallStackIndex,
	String^% GUID,
	int% TowerID,
	int% NumberPiers,
	int% NUmberSpandrels
)
abstract GetDetailed_OneWallStack :
        WallStackIndex : int *
        GUID : string byref *
        TowerID : int byref *
        NumberPiers : int byref *
        NUmberSpandrels : int byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
GUID
Type: System.String
 Unique GUID asssigned to the Wall Stack
TowerID
Type: System.Int32
 The index of Tower, in which this Stack belongs to. Taken from ETABS
NumberPiers
Type: System.Int32
 All Piers in the the wall stack, on all floors
NUmberSpandrels
Type: System.Int32
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace